128
258
131
1796
4
901
642
136
1030
10
11
13
142
143
1041
1176
1310
1055
32
33
162
35
36
31
414
421
1187
43
45
46
177
437
66
70
198
329
81
219
95
225
100
485
102
869
233
1644
1521
498
1011
256
1
2
1400
396
140
141
267
16
17
20
21
407
23
24
26
27
25
925
895
285
801
291
38
1190
678
1577
44
689
308
55
567
697
185
190
1216
325
457
73
1482
458
208
92
476
98
610
235
111
1136
112
754
1144
1017
379
1149
638
255
7
2184
266
653
530
19
148
155
29
669
161
934
2214
40
297
42
1458
569
576
1351
719
336
1746
468
597
341
1239
2012
94
1379
103
109
242
118
248
635
508
765
1557
5
646
8
9
523
1672
15
649
662
150
28
287
416
930
430
47
303
50
174
181
184
57
58
570
186
67
76
333
82
723
85
89
605
354
867
230
490
1515
621
625
114
115
378
1792
268
270
657
795
160
1487
357
386
388
773
522
398
1676
278
792
296
426
1704
559
179
436
54
1074
60
828
959
65
323
68
587
335
80
1877
1635
1255
241
117
249
2172
259
132
12
158
672
39
300
557
62
331
1100
91
1373
480
737
999
231
110
368
373
376
515
516
6
520
18
1060
550
1574
48
1591
1597
1102
593
83
1629
101
104
113
121
126
127
673
1199
191
706
195
211
1238
767
265
779
1319
321
2374
1385
371
467
2003
1005
502
768
514
651
14
274
146
919
1564
1068
1326
453
966
204
84
217
93
733
487
1256
236
116
392
1171
22
156
411
37
169
52
53
310
200
332
87
727
347
1501
1381
108
1261
501
122
1279
133
905
2188
1911
273
658
661
682
1325
561
1714
948
1845
442
212
1752
473
860
226
494
1519
244
1142
119
2944
637
263
3082
786
3086
2324
399
154
282
666
542
417
1572
2469
2170
1956
937
1454
2353
2554
312
2937
189
1727
322
196
326
595
599
1368
613
1895
377
620
751
881
758
374
1014
125
262
144
1300
799
295
1833
1709
318
64
836
1610
1231
852
749
367
632
3
41
1067
56
1606
78
2128
1627
616
1151
1159
138
145
1181
170
180
201
1226
207
1232
1260
1311
823
848
1386
383
912
422
455
996
554
558
563
72
75
107
120
129
1161
137
171
178
1217
197
205
1757
739
740
261
272
344
375
958
463
1031
529
538
546
49
59
572
63
71
608
123
696
234
301
306
853
350
883
401
1447
427
537
30
1439
313
445
61
969
979
216
993
482
359
124
1021
1539
1174
1786
551
816
1198
1462
1076
1729
1220
1490
983
106
1271
1912
1664
654
424
677
1584
1970
701
316
1084
1087
1859
1221
2004
483
238
495
785
1048
2213
1963
588
222
353
628
629
1153
903
910
659
929
317
461
209
851
503
743
885
513
1548
2446
1305
540
545
1185
2467
681
826
577
579
707
714
847
464
1489
994
868
876
877
627
757
2556
1299
1957
1707
709
1361
617
250
782
664
534
2089
941
304
194
977
1775
1265
499
1272
527
528
2124
624
631
135
652
151
665
159
165
172
175
192
722
724
214
748
284
1316
307
330
871
408
1466
510
1158
906
793
1826
1460
704
1474
1734
1237
982
1649
1537
1051
34
692
311
734
96
99
381
639
2086
2109
1089
590
1105
97
618
2677
2718
167
173
693
2271
1768
755
769
1343
337
361
894
1924
2470
429
439
3000
2489
2043
390
1294
547
2468
943
305
1717
1224
213
474
614
1015
574
1090
79
130
1178
168
176
1214
741
232
237
243
257
770
349
872
372
916
432
1465
484
521
1600
1094
1099
1617
2135
1167
157
1186
718
245
1785
251
804
809
815
839
328
387
1441
456
998
544
1061
1317
1210
712
86
1112
1131
1582
846
1365
985
736
1252
2018
1783
283
670
1063
431
818
1719
955
1208
705
964
840
1234
1248
866
1123
488
489
746
1900
1010
1139
1281
956
320
591
338
1242
1009
1426
807
825
1212
721
352
1809
275
1431
1196
2608
2611
1337
1722
1342
2623
1857
2501
1350
1863
1480
74
88
747
1259
1530
1566
688
345
763
1155
1671
1038
1175
536
164
817
314
1353
77
594
849
857
738
486
1391
369
252
1531
1020
1806
397
1312
2209
855
1885
239
1024
775
409
1949
1195
1073
829
199
1509
630
1411
271
533
281
700
1469
1603
228
1266
512
560
364
391
410
496
264
780
339
730
229
362
1518
507
641
1402
526
292
1323
1452
1222
596
343
227
1383
1003
1267
1656
961
710
1370
1642
299
940
813
438
1406
385
402
1706
819
451
471
215
348
1524
2314
911
276
405
789
675
553
1980
1223
2513
1498
1121
890
1561
1058
293
1327
1207
1477
454
715
1113
1120
1135
1910
1083
380
1552
289
1657
1184
1586
592
465
1107
1133
269
923
163
294
1471
193
598
1145
1168
2039
1825
1581
699
1984
1348
1229
346
1788
1160
691
1598
578
1741
1250
1393
1082
663
745
277
1332
978
798
1449
358
492
1931
784
1418
1686
2198
1693
1463
761
640
1296
1938
1064
575
1088
1235
602
1258
899
2053
1424
820
2497
2245
1358
1870
726
2429
1164
1587
69
2005
732
924
413
822
850
1405
1096
584
440
459
493
2037
1534
984
1662
2452
223
1413
134
393
525
1416
1427
153
1053
1054
1448
51
947
182
309
953
319
583
327
460
1360
210
725
612
1124
360
1766
756
246
766
2049
1488
1269
2047
472
1039
290
166
1331
1464
187
90
519
781
1293
655
1699
1192
1328
713
997
874
1012
1303
412
531
650
2190
366
887
896
404
1961
687
1739
2411
951
854
1367
772
1380
395
1423
915
1045
806
423
936
556
944
703
832
834
206
607
506
1156
679
778
824
365
1953
788
1313
1283
1344
1503
879
1205
760
1570
1338
1026
1916
1639
1914
1665
389
1964
2382
859
1246
1018
2299
647
674
952
1103
729
247
1536
1071
1759
481
1638
908
698
1545
1823
444
1486
626
1040
1435
1334
1378
1710
478
690
425
1670
856
1514
926
253
1410
435
202
702
1152
139
794
452
1347
105
2412
884
1675
1687
2142
1412
1429
441
960
1278
1023
1590
315
728
1497
479
497
1052
1059
1573
221
975
1033
1163
1549
356
873
188
1641
898
2380
1533
1315
1329
1057
1106
1580
585
753
913
1576
1081
774
1288
535
581
400
974
870
2942
917
1182
2084
1450
695
1230
1363
1770
623
1394
518
1042
1567
1098
1493
1700
470
571
1114
1117
609
1526
511
1287
1679
1648
298
1204
864
833
1491
604
992
914
922
935
342
149
2071
667
808
2125
1869
355
1000
2032
288
280
549
566
1681
1172
420
1320
552
972
1049
1050
933
1200
565
447
603
2074
2138
240
762
643
783
152
1694
1821
415
805
1959
814
2094
957
449
491
1390
254
509
1154
771
787
1874
764
1723
1275
370
1077
1798
791
1101
1499
1715
2103
1119
1225
1233
1289
1827
351
949
2879
1478
3051
1555
1280
541
443
731
1247
882
1150
1314
384
394
418
419
543
928
685
1095
711
586
981
1502
759
1140
1453
260
892
1881
744
1678
500
1535
1419
1148
1620
1666
555
1364
1764
1179
1887
2481
1554
2007
1137
1569
2181
660
1032
183
446
1147
600
1118
224
1517
2066
619
2448
1304
1837
2493
1346
2631
742
1127
2407
1898
1520
1263
1654
633
1605
606
1274
466
532
735
888
986
1812
1593
1254
1075
1202
1434
1397
918
1528
1689
668
1322
1987
1069
1698
1779
1903
601
863
1622
611
1774
1944
1975
1977
1476
1492
1682
1690
450
1602
1138
1403
1659
220
2306
2090
1273
800
1807
1298
837
987
1772
448
1091
1455
2199
671
644
1425
1165
1201
434
1093
203
589
218
1251
1213
838
382
920
504
1029
2244
2365
562
1695
1245
1290
1335
963
1108
2010
568
1354
279
939
1646
2078
1607
147
1211
976
683
716
2475
886
1034
802
1340
988
1511
891
686
950
1016
622
1128
615
1044
921
827
1046
517
1541
1291
1932
945
1945
1946
1437
1070
433
1336
2237
1473
841
1227
1483
1891
1257
1513
1901
880
889
1092
1324
1191
1623
1262
1628
1795
1396
2095
475
648
1019
505
1292
1738
897
2081
2118
1630
1228
2792
1374
862
970
1631
1249
2313
1362
1461
2006
1065
1253
790
811
656
1286
831
875
1398
469
1028
324
1122
752
1876
1407
1546
1808
1341
1731
1356
1496
858
2160
1905
1553
2224
1086
2167
1743
1264
1308
842
1472
1022
2881
1484
1633
564
2230
1864
902
2194
1650
1907
2168
1173
403
1479
2518
989
1643
980
1954
1589
1339
967
865
1736
363
1004
634
900
2101
907
1203
1330
1240
1037
1301
1578
477
1388
340
971
844
1632
1636
1889
1056
2582
2892
2260
1765
645
1818
1668
2158
1132
1871
893
286
2523
1002
1047
1568
1377
1588
995
539
1382
1890
573
991
1838
1784
909
428
1062
302
821
1366
1728
1525
1345
1243
942
1399
803
1653
1130
2016
1562
1110
684
1972
904
1036
676
962
1219
965
1753
2877
1658
1143
1782
796
1702
830
334
861
1295
812
1716
1008
1027
938
1769
810
717
1962
750
1505
1359
2040
2331
1651
1276
1170
1169
1556
2356
1994
